<?php

declare(strict_types=1);

return [
    'dashboard' => [
        'title' => 'Προβολέας Αρχείων Καταγραφής',
    ],
    'show' => [
        'title' => 'Προβολή αρχείου καταγραφής :log',
    ],
    'navigation' => [
        'group' => 'Αρχεία Καταγραφής',
        'label' => 'Προβολέας Αρχείων Καταγραφής',
        'sort' => 100,
    ],
    'table' => [
        'columns' => [
            'date' => [
                'label' => 'Ημερομηνία',
            ],
            'level' => [
                'label' => 'Επίπεδο',
            ],
            'message' => [
                'label' => 'Μήνυμα',
            ],
            'filename' => [
                'label' => 'Όνομα Αρχείου',
            ],
        ],
        'actions' => [
            'view' => [
                'label' => 'Προβολή',
            ],
            'download' => [
                'label' => 'Λήψη αρχείου καταγραφής :log',
                'bulk' => [
                    'label' => 'Λήψη αρχείων καταγραφής',
                    'error' => 'Σφάλμα κατά τη λήψη αρχείων καταγραφής',
                ],
            ],
            'delete' => [
                'label' => 'Διαγραφή αρχείου καταγραφής :log',
                'success' => 'Το αρχείο καταγραφής διαγράφηκε με επιτυχία',
                'error' => 'Σφάλμα κατά τη διαγραφή του αρχείου καταγραφής',
                'bulk' => [
                    'label' => 'Διαγραφή επιλεγμένων αρχείων καταγραφής',
                ],
            ],
            'clear' => [
                'label' => 'Εκκαθάριση αρχείου καταγραφής :log',
                'success' => 'Το αρχείο καταγραφής εκκαθαρίστηκε με επιτυχία',
                'error' => 'Σφάλμα κατά την εκκαθάριση του αρχείου καταγραφής',
                'bulk' => [
                    'success' => 'Τα αρχεία καταγραφής εκκαθαρίστηκαν με επιτυχία',
                    'label' => 'Εκκαθάριση επιλεγμένων αρχείων καταγραφής',
                ],
            ],
            'close' => [
                'label' => 'Πίσω',
            ],
        ],
        'modal' => [
            'search_placeholder' => 'Αναζήτηση αρχείων καταγραφής...',
            'go_to_top' => 'Πανω μέρος',
            'go_to_bottom' => 'Κάτω μέρος',
            'top' => 'Πανω',
            'bottom' => 'Κάτω',
            'no_matching_entries' => 'Δεν υπάρχουν αντίστοιχες καταχωρήσεις αρχείου καταγραφής.',
            'no_entries' => 'Δεν υπάρχουν καταχωρήσεις αρχείου καταγραφής.',
            'context' => 'Περιεχόμενο',
            'stack_trace' => 'Ιχνηλάτηση Στοίβας',
        ],
        'detail' => [
            'title' => 'Λεπτομέρεια',
            'file_path' => 'Διαδρομή Αρχείου',
            'log_entries' => 'Καταχωρήσεις',
            'size' => 'Μέγεθος',
            'created_at' => 'Δημιουργήθηκε',
            'updated_at' => 'Ενημερώθηκε',
        ],
    ],
    'levels' => [
        'all' => 'Όλα',
        'emergency' => 'Κατάσταση Έκτακτης Ανάγκης',
        'alert' => 'Ειδοποίηση',
        'critical' => 'Κρίσιμο',
        'error' => 'Σφάλμα',
        'warning' => 'Προειδοποίηση',
        'notice' => 'Ειδοποίηση',
        'info' => 'Πληροφορία',
        'debug' => 'Αποσφαλμάτωση',
    ],
];
