<?php

declare(strict_types=1);

return [
    'dashboard' => [
        'title' => 'Преглед на логове',
    ],
    'show' => [
        'title' => 'Преглед на лога :log',
    ],
    'navigation' => [
        'group' => 'Логове',
        'label' => 'Преглед на логове',
        'sort' => 100,
    ],
    'table' => [
        'columns' => [
            'date' => [
                'label' => 'Дата',
            ],
            'level' => [
                'label' => 'Ниво',
            ],
            'message' => [
                'label' => 'Съобщение',
            ],
            'filename' => [
                'label' => 'Име на файл',
            ],
        ],
        'actions' => [
            'view' => [
                'label' => 'Преглед',
            ],
            'download' => [
                'label' => 'Изтегляне на лога :log',
                'bulk' => [
                    'label' => 'Изтегляне на логове',
                    'error' => 'Грешка при изтегляне на логовете',
                ],
            ],
            'delete' => [
                'label' => 'Изтриване на лога :log',
                'success' => 'Логът е успешно изтрит',
                'error' => 'Грешка при изтриване на лога',
                'bulk' => [
                    'label' => 'Изтриване на избраните логове',
                ],
            ],
            'clear' => [
                'label' => 'Изчистване на лога :log',
                'success' => 'Логът е успешно изчистен',
                'error' => 'Грешка при изчистване на лога',
                'bulk' => [
                    'success' => 'Логовете са успешно изчистени',
                    'label' => 'Изчистване на избраните логове',
                ],
            ],
            'close' => [
                'label' => 'Назад',
            ],
        ],
        'modal' => [
            'search_placeholder' => 'Търсене в логовете...',
            'go_to_top' => 'Към началото',
            'go_to_bottom' => 'Към края',
            'top' => 'Начало',
            'bottom' => 'Край',
            'no_matching_entries' => 'Няма съответстващи записи в логовете.',
            'no_entries' => 'Няма записи в логовете.',
            'context' => 'Контекст',
            'stack_trace' => 'Проследяване на стека',
        ],
        'detail' => [
            'title' => 'Детайли',
            'file_path' => 'Пътека до файла',
            'log_entries' => 'Записи',
            'size' => 'Размер',
            'created_at' => 'Създадено',
            'updated_at' => 'Актуализирано',
        ],
    ],
    'levels' => [
        'all' => 'Всички',
        'emergency' => 'Аварийно',
        'alert' => 'Внимание',
        'critical' => 'Критично',
        'error' => 'Грешка',
        'warning' => 'Предупреждение',
        'notice' => 'Уведомление',
        'info' => 'Информация',
        'debug' => 'Отладка',
    ],
];
