<?php

declare(strict_types=1);

return [
    'dashboard' => [
        'title' => 'Прагляднік журналаў',
    ],
    'show' => [
        'title' => 'Прагляд журнала :log',
    ],
    'navigation' => [
        'group' => 'Журналы',
        'label' => 'Прагляднік журналаў',
        'sort' => 100,
    ],
    'table' => [
        'columns' => [
            'date' => [
                'label' => 'Дата',
            ],
            'level' => [
                'label' => 'Ўзровень',
            ],
            'message' => [
                'label' => 'Паведамленне',
            ],
            'filename' => [
                'label' => 'Імя файла',
            ],
        ],
        'actions' => [
            'view' => [
                'label' => 'Прагляд',
            ],
            'download' => [
                'label' => 'Загрузіць журнал :log',
                'bulk' => [
                    'label' => 'Загрузіць журналы',
                    'error' => 'Памылка пры загрузцы журналаў',
                ],
            ],
            'delete' => [
                'label' => 'Удаліць журнал :log',
                'success' => 'Журнал успешна удалены',
                'error' => 'Памылка пры удаленні журнала',
                'bulk' => [
                    'label' => 'Удаліць вылучаныя журналы',
                ],
            ],
            'clear' => [
                'label' => 'Ачысціць журнал :log',
                'success' => 'Журнал успешна ачышчаны',
                'error' => 'Памылка пры ачыстцы журнала',
                'bulk' => [
                    'success' => 'Журналы успешна ачышчаны',
                    'label' => 'Ачысціць вылучаныя журналы',
                ],
            ],
            'close' => [
                'label' => 'Назад',
            ],
        ],
        'modal' => [
            'search_placeholder' => 'Пошук журналаў...',
            'go_to_top' => 'На адзінку',
            'go_to_bottom' => 'У конец',
            'top' => 'Адзінка',
            'bottom' => 'Конец',
            'no_matching_entries' => 'Нет адпавядаючых запісаў журнала.',
            'no_entries' => 'Нет запісаў журнала.',
            'context' => 'Кантекст',
            'stack_trace' => 'Трасіроўка стэка',
        ],
        'detail' => [
            'title' => 'Дэталь',
            'file_path' => 'Шлях да файла',
            'log_entries' => 'Запісы',
            'size' => 'Размер',
            'created_at' => 'Створана',
            'updated_at' => 'Абноўлена',
        ],
    ],
    'levels' => [
        'all' => 'Усе',
        'emergency' => 'Адзінка',
        'alert' => 'Папярэджанне',
        'critical' => 'Крытычны',
        'error' => 'Памылка',
        'warning' => 'Папярэджанне',
        'notice' => 'Ведамасць',
        'info' => 'Інфармацыя',
        'debug' => 'Адладка',
    ],
];
