<?php

declare(strict_types=1);

return [
    'dashboard' => [
        'title' => 'Преглед дневника',
    ],
    'show' => [
        'title' => 'Прегледај дневник :log',
    ],
    'navigation' => [
        'group' => 'Дневници',
        'label' => 'Преглед дневника',
        'sort' => 100,
    ],
    'table' => [
        'columns' => [
            'date' => [
                'label' => 'Датум',
            ],
            'level' => [
                'label' => 'Ниво',
            ],
            'message' => [
                'label' => 'Поруку',
            ],
            'filename' => [
                'label' => 'Назив датотеке',
            ],
        ],
        'actions' => [
            'view' => [
                'label' => 'Прегледај',
            ],
            'download' => [
                'label' => 'Преузмите дневник :log',
                'bulk' => [
                    'label' => 'Преузмите дневнике',
                    'error' => 'Грешка при преузимању дневника',
                ],
            ],
            'delete' => [
                'label' => 'Обриши дневник :log',
                'success' => 'Дневник је успешно обрисан',
                'error' => 'Грешка при брисању дневника',
                'bulk' => [
                    'label' => 'Обриши одабране дневнике',
                ],
            ],
            'clear' => [
                'label' => 'Очисти дневник :log',
                'success' => 'Дневник је успешно очишћен',
                'error' => 'Грешка при очишћењу дневника',
                'bulk' => [
                    'success' => 'Дневници су успешно очишћени',
                    'label' => 'Очисти одабране дневнике',
                ],
            ],
            'close' => [
                'label' => 'Назад',
            ],
        ],
        'modal' => [
            'search_placeholder' => 'Претражи дневнике...',
            'go_to_top' => 'Иди на врх',
            'go_to_bottom' => 'Иди на дно',
            'top' => 'Врх',
            'bottom' => 'Дно',
            'no_matching_entries' => 'Нема подударних уноса дневника.',
            'no_entries' => 'Нема уноса дневника.',
            'context' => 'Контекст',
            'stack_trace' => 'Трага стека',
        ],
        'detail' => [
            'title' => 'Детаљи',
            'file_path' => 'Путања датотеке',
            'log_entries' => 'Уноси',
            'size' => 'Величина',
            'created_at' => 'Направљено',
            'updated_at' => 'Ажурирано',
        ],
    ],
    'levels' => [
        'all' => 'Све',
        'emergency' => 'Хитно',
        'alert' => 'Упозорење',
        'critical' => 'Критично',
        'error' => 'Грешка',
        'warning' => 'Упозорење',
        'notice' => 'Обавештење',
        'info' => 'Информација',
        'debug' => 'Отклањање грешака',
    ],
];
